Repository: zeroy1024/Swift-Craft-Launcher
Catalog: SwiftCraftLauncher/Resources/Localizable.xcstrings
Source language: en
Languages: ar, da, de, es, fi, fr, hi, it, ja, ko, nb, nl, pl, pt, ru, sv, th, tr, vi, zh_hans, zh_hant

# settings.common_sheet_height_limit.enable
source: Limit height on small screens
ar: تقييد الارتفاع على الأجهزة الصغيرة
da: Begræns højde på små skærme
de: Höhe auf kleinen Bildschirmen begrenzen
es: Limitar altura en pantallas pequeñas
fi: Rajoita korkeus pienillä näytöillä
fr: Limiter la hauteur sur les petits écrans
hi: छोटी स्क्रीन पर ऊंचाई सीमित करें
it: Limita l’altezza sui piccoli schermi
ja: 小さい画面で高さを制限する
ko: 작은 화면에서 높이 제한
nb: Begrens høyde på små skjermer
nl: Hoogte beperken op kleine schermen
pl: Ogranicz wysokość na małych ekranach
pt: Limitar altura em telas pequenas
ru: Ограничить высоту на маленьких экранах
sv: Begränsa höjd på små skärmar
th: จำกัดความสูงบนหน้าจอขนาดเล็ก
tr: Küçük ekranlarda yüksekliği sınırla
vi: Giới hạn chiều cao trên màn hình nhỏ
zh_hans: 在小屏设备上限制高度
zh_hant: 在小螢幕裝置上限制高度

# settings.common_sheet_height_limit.label
source: Window Height Limit
ar: حد ارتفاع النافذة
da: Højdebegrænsning for vindue
de: Fensterhöhenbegrenzung
es: Límite de altura de la ventana
fi: Ikkunan korkeuden rajoitus
fr: Limite de hauteur de la fenêtre
hi: विंडो ऊंचाई सीमा
it: Limite altezza finestra
ja: ウィンドウの高さ制限
ko: 창 높이 제한
nb: Høydebegrensning for vindu
nl: Hoogtelimiet voor venster
pl: Limit wysokości okna
pt: Limite de altura da janela
ru: Ограничение высоты окна
sv: Höjdbegränsning för fönster
th: จำกัดความสูงของหน้าต่าง
tr: Pencere yüksekliği sınırı
vi: Giới hạn chiều cao cửa sổ
zh_hans: 窗口高度限制
zh_hant: 視窗高度限制

# settings.concurrent_downloads.label
source: Concurrent Downloads
ar: التحميلات المتزامنة
da: Samtidige Downloads
de: Gleichzeitige Downloads
es: Descargas Concurrentes
fi: Samanaikaiset Lataukset
fr: Téléchargements Simultanés
hi: समानांतर डाउनलोड
it: Download Simultanei
ja: 同時ダウンロード数
ko: 동시 다운로드
nb: Samtidige Nedlastinger
nl: Gelijktijdige Downloads
pl: Równoległe Pobierania
pt: Downloads Simultâneos
ru: Одновременные Загрузки
sv: Samtidiga Nedladdningar
th: การดาวน์โหลดพร้อมกัน
tr: Eşzamanlı İndirmeler
vi: Tải Xuống Đồng Thời
zh_hans: 下载并发数
zh_hant: 下載並發數

# settings.default_api_source.label
source: Default API Source
ar: مصدر واجهة برمجة التطبيقات الافتراضي
da: Standard API-kilde
de: Standard-API-Quelle
es: Fuente de API Predeterminada
fi: Oletus-API-lähde
fr: Source d'API par Défaut
hi: डिफ़ॉल्ट API स्रोत
it: Sorgente API Predefinita
ja: デフォルトAPIソース
ko: 기본 API 소스
nb: Standard API-kilde
nl: Standaard API-bron
pl: Domyślne Źródło API
pt: Fonte de API Padrão
ru: Источник API по Умолчанию
sv: Standard API-källa
th: แหล่ง API เริ่มต้น
tr: Varsayılan API Kaynağı
vi: Nguồn API Mặc định
zh_hans: 默认接口来源
zh_hant: 預設介面來源

# settings.default_memory_allocation.description
source: Set the minimum and maximum memory allocation for Minecraft. The minimum value (Xms) is the initial memory allocated when the game starts, and the maximum value (Xmx) is the maximum memory the game can use.
ar: قم بتعيين الحد الأدنى والحد الأقصى لتخصيص الذاكرة لـ Minecraft. القيمة الدنيا (Xms) هي الذاكرة الأولية المخصصة عند بدء اللعبة، والقيمة القصوى (Xmx) هي الحد الأقصى للذاكرة التي يمكن للعبة استخدامها.
da: Indstil minimum- og maksimum-hukommelsesallokering for Minecraft. Minimumværdien (Xms) er den indledende hukommelse, der tildeles, når spillet starter, og maksimumværdien (Xmx) er den maksimale hukommelse, spillet kan bruge.
de: Legen Sie die minimale und maximale Speicherzuweisung für Minecraft fest. Der Mindestwert (Xms) ist der beim Spielstart zugewiesene Anfangsspeicher, und der Maximalwert (Xmx) ist der maximale Speicher, den das Spiel verwenden kann.
es: Establece la asignación mínima y máxima de memoria para Minecraft. El valor mínimo (Xms) es la memoria inicial asignada cuando el juego comienza, y el valor máximo (Xmx) es la memoria máxima que el juego puede usar.
fi: Aseta Minecraftin vähimmäis- ja enimmäismuistin allokointi. Vähimmäisarvo (Xms) on pelin käynnistyessä varattu alkuperäinen muisti, ja enimmäisarvo (Xmx) on suurin muisti, jota peli voi käyttää.
fr: Définissez l'allocation minimale et maximale de mémoire pour Minecraft. La valeur minimale (Xms) est la mémoire initiale allouée au démarrage du jeu, et la valeur maximale (Xmx) est la mémoire maximale que le jeu peut utiliser.
hi: Minecraft के लिए न्यूनतम और अधिकतम मेमोरी आवंटन सेट करें। न्यूनतम मान (Xms) खेल शुरू होने पर आवंटित प्रारंभिक मेमोरी है, और अधिकतम मान (Xmx) वह अधिकतम मेमोरी है जिसका उपयोग खेल कर सकता है।
it: Imposta l'allocazione minima e massima della memoria per Minecraft. Il valore minimo (Xms) è la memoria iniziale allocata all'avvio del gioco, e il valore massimo (Xmx) è la memoria massima che il gioco può utilizzare.
ja: Minecraftの最小および最大メモリ割り当てを設定します。最小値（Xms）はゲーム開始時に割り当てられる初期メモリで、最大値（Xmx）はゲームが使用できる最大メモリです。
ko: Minecraft의 최소 및 최대 메모리 할당을 설정합니다。 최소값（Xms)은 게임 시작 시 할당되는 초기 메모리이고， 최대값（Xmx)은 게임이 사용할 수 있는 최대 메모리입니다。
nb: Angi minimum- og maksimum minneallokering for Minecraft. Minimumsverdien (Xms) er det innledende minnet som tildeles når spillet starter, og maksimumsverdien (Xmx) er det maksimale minnet spillet kan bruke.
nl: Stel de minimale en maximale geheugentoewijzing voor Minecraft in. De minimumwaarde (Xms) is het initiële geheugen dat wordt toegewezen wanneer het spel start, en de maximumwaarde (Xmx) is het maximale geheugen dat het spel kan gebruiken.
pl: Ustaw minimalną i maksymalną alokację pamięci dla Minecraft. Wartość minimalna (Xms) to początkowa pamięć przydzielona przy starcie gry, a wartość maksymalna (Xmx) to maksymalna pamięć, którą gra może wykorzystać.
pt: Defina a alocação mínima e máxima de memória para Minecraft. O valor mínimo (Xms) é a memória inicial alocada quando o jogo inicia, e o valor máximo (Xmx) é a memória máxima que o jogo pode usar.
ru: Установите минимальное и максимальное выделение памяти для Minecraft. Минимальное значение (Xms) — это начальная память, выделяемая при запуске игры, а максимальное значение (Xmx) — это максимальная память, которую игра может использовать.
sv: Ange den minsta och största minnesallokeringen för Minecraft. Minimivärdet (Xms) är det initiala minnet som allokeras när spelet startar, och maximivärdet (Xmx) är det maximala minnet som spelet kan använda.
th: ตั้งค่าการจัดสรรหน่วยความจำขั้นต่ำและสูงสุดสำหรับ Minecraft ค่าต่ำสุด (Xms) คือหน่วยความจำเริ่มต้นที่จัดสรรเมื่อเกมเริ่มต้น และค่าสูงสุด (Xmx) คือหน่วยความจำสูงสุดที่เกมสามารถใช้ได้
tr: Minecraft için minimum ve maksimum bellek ayırmayı ayarlayın. Minimum değer (Xms), oyun başladığında ayrılan başlangıç belleğidir ve maksimum değer (Xmx), oyunun kullanabileceği maksimum bellektir.
vi: Đặt phân bổ bộ nhớ tối thiểu và tối đa cho Minecraft. Giá trị tối thiểu (Xms) là bộ nhớ ban đầu được phân bổ khi trò chơi khởi động, và giá trị tối đa (Xmx) là bộ nhớ tối đa mà trò chơi có thể sử dụng.
zh_hans: 设置Minecraft的最小和最大内存分配。最小值（Xms）是游戏启动时分配的初始内存，最大值（Xmx）是游戏可以使用的最大内存。
zh_hant: 設定Minecraft的最小和最大記憶體分配。最小值（Xms）是遊戲啟動時分配的初始記憶體，最大值（Xmx）是遊戲可以使用的最大記憶體。

# settings.default_memory_allocation.label
source: Global Memory Allocation
ar: تخصيص الذاكرة العامة
da: Global Hukommelsesallokering
de: Globale Speicherzuteilung
es: Asignación Global de Memoria
fi: Globaali Muistin Allokointi
fr: Allocation Mémoire Globale
hi: ग्लोबल मेमोरी आवंटन
it: Allocazione Memoria Globale
ja: グローバルメモリ割り当て
ko: 전역 메모리 할당
nb: Global Minneallokering
nl: Globale Geheugenallocatie
pl: Globalna Alokacja Pamięci
pt: Alocação Global de Memória
ru: Глобальное Выделение Памяти
sv: Global Minnesallokering
th: การจัดสรรหน่วยความจำทั่วโลก
tr: Global Bellek Tahsisi
vi: Phân Bổ Bộ Nhớ Toàn Cục
zh_hans: 全局内存分配
zh_hant: 全域記憶體分配

# settings.game_versions.include_snapshots.label
source: Include Snapshot Versions
ar: تضمين إصدارات Snapshot
da: Inkluder snapshot-versioner
de: Schnappschussversionen einschließen
es: Incluir versiones snapshot
fi: Sisällytä snapshot-versiot
fr: Inclure les versions snapshot
hi: स्नैपशॉट संस्करण शामिल करें
it: Includi versioni snapshot
ja: スナップショット版を含める
ko: 스냅샷 버전 포함
nb: Inkluder snapshot-versjoner
nl: Snapshot-versies opnemen
pl: Uwzględnij wersje snapshot
pt: Incluir versões snapshot
ru: Включать версии снапшотов
sv: Inkludera snapshot-versioner
th: รวมเวอร์ชัน Snapshot
tr: Snapshot sürümlerini dahil et
vi: Bao gồm phiên bản snapshot
zh_hans: 包含快照版
zh_hant: 包含快照版

# settings.game_versions.label
source: Game Versions
ar: إصدارات اللعبة
da: Spilversioner
de: Spielversionen
es: Versiones del juego
fi: Peliversiot
fr: Versions du jeu
hi: गेम संस्करण
it: Versioni del gioco
ja: ゲームバージョン
ko: 게임 버전
nb: Spillversjoner
nl: Spelversies
pl: Wersje gry
pt: Versões do jogo
ru: Версии игры
sv: Spelversioner
th: เวอร์ชันของเกม
tr: Oyun Sürümleri
vi: Phiên bản trò chơi
zh_hans: 游戏版本列表
zh_hant: 遊戲版本列表

# settings.game.advanced
source: Advanced Game Settings
ar: الإعدادات المتقدمة للعبة
da: Avancerede spilindstillinger
de: Erweiterte Spieleinstellungen
es: Configuración avanzada del juego
fi: Pelin lisäasetukset
fr: Paramètres avancés du jeu
hi: उन्नत गेम सेटिंग्स
it: Impostazioni avanzate del gioco
ja: ゲームの詳細設定
ko: 게임 고급 설정
nb: Avanserte spillinnstillinger
nl: Geavanceerde spelinstellingen
pl: Zaawansowane ustawienia gry
pt: Configurações avançadas do jogo
ru: Расширенные настройки игры
sv: Avancerade spelinställningar
th: การตั้งค่าขั้นสูงของเกม
tr: Gelişmiş oyun ayarları
vi: Cài đặt trò chơi nâng cao
zh_hans: 高级游戏设置
zh_hant: 進階遊戲設定

# settings.game.advanced.tab
source: Current Game
ar: اللعبة الحالية
da: Nuværende spil
de: Aktuelles Spiel
es: Juego actual
fi: Nykyinen peli
fr: Jeu actuel
hi: वर्तमान गेम
it: Gioco corrente
ja: 現在のゲーム
ko: 현재 게임
nb: Nåværende spill
nl: Huidige game
pl: Bieżąca gra
pt: Jogo atual
ru: Текущая игра
sv: Nuvarande spel
th: เกมปัจจุบัน
tr: Mevcut Oyun
vi: Trò chơi hiện tại
zh_hans: 当前游戏
zh_hant: 當前遊戲

# settings.game.clear_cache.help
source: Clears the local mod cache that failed to scan, so scanning can be triggered again to fetch details as much as possible.
ar: يمسح ذاكرة التخزين المؤقت المحلية للملفات الإضافية (mod) التي فشلت في الفحص، حتى يمكن تشغيل الفحص مرة أخرى لجلب التفاصيل قدر الإمكان.
da: Rydder den lokale mod-cache, der mislykkedes med scanning, så scanning kan udløses igen for at hente detaljer så meget som muligt.
de: Löscht den lokalen Mod-Cache, der beim Scannen fehlgeschlagen ist, damit das Scannen erneut ausgelöst werden kann, um Details so weit wie möglich abzurufen.
es: Borra la caché local de mods que falló al escanear, para que se pueda volver a ejecutar el escaneo y obtener los detalles en la medida de lo posible.
fi: Tyhjentää paikallisen modivälimuistin, joka epäonnistui skannauksessa, jotta skannaus voidaan käynnistää uudelleen ja hakemaan tiedot mahdollisimman paljon.
fr: Efface le cache local des mods dont le scan a échoué, afin que le scan puisse être relancé pour récupérer les détails autant que possible.
hi: यह उन स्थानीय mod कैश को साफ़ करता है जिसका स्कैन करने में विफल रहा, ताकि स्कैन फिर से ट्रिगर हो सके और यथासंभव विवरण मिल सकें।
it: Svuota la cache locale dei mod che non è riuscita a essere scansionata, così la scansione può essere riavviata per ottenere i dettagli il più possibile.
ja: スキャンに失敗したローカルのmodキャッシュを消去します。スキャンを再実行して、可能な限り詳細を取得します。
ko: 스캔에 실패한 로컬 모드 캐시를 지웁니다。 스캔을 다시 실행해 가능한 한 상세 정보를 가져옵니다。
nb: Tømmer lokal mod-buffer som feilet å skanne, slik at skanning kan trigges på nytt for å hente detaljer så langt som mulig.
nl: Wist de lokale mod-cache waarvan het scannen is mislukt, zodat het scannen opnieuw kan worden geactiveerd om details zo veel mogelijk op te halen.
pl: Wyczyści lokalny cache modów, których skanowanie nie powiodło się, aby można było ponownie uruchomić skanowanie i uzyskać szczegóły w możliwie największym stopniu.
pt: Limpa a cache local dos mods que falharam na verificação, para que a verificação possa ser acionada novamente e buscar os detalhes o máximo possível.
ru: Очищает локальный кэш mod’ов, сканирование которых не удалось, чтобы можно было повторно запустить сканирование и получить детали в максимально возможной степени.
sv: Rensar lokal modcache som misslyckades med skanning, så att skanning kan utlösas igen för att hämta detaljer så mycket som möjligt.
th: ล้างแคชม็อดในเครื่องที่สแกนไม่สำเร็จ เพื่อให้สามารถสแกนซ้ำอีกครั้งและดึงรายละเอียดได้มากที่สุดเท่าที่จะทำได้
tr: Tarama sırasında başarısız olan yerel mod önbelleğini temizler; böylece tarama yeniden tetiklenip ayrıntılar mümkün olduğunca alınabilir.
vi: Xóa bộ nhớ đệm mod cục bộ bị lỗi khi quét, để có thể kích hoạt lại việc quét nhằm lấy thông tin chi tiết nhiều nhất có thể.
zh_hans: 清理扫描失败的本地mod缓存，用于重新触发扫描，以尽可能获取详情
zh_hant: 清理掃描失敗的本地mod快取，用於重新觸發掃描，以盡可能取得詳情

# settings.game.clear_cache.label
source: Clear Cache
ar: مسح ذاكرة التخزين المؤقت
da: Ryd cache
de: Cache löschen
es: Borrar caché
fi: Tyhjennä välimuisti
fr: Effacer le cache
hi: कैश साफ़ करें
it: Svuota la cache
ja: キャッシュを消去
ko: 캐시 지우기
nb: Tøm hurtigbuffer
nl: Cache wissen
pl: Wyczyść pamięć podręczną
pt: Limpar cache
ru: Очистить кэш
sv: Rensa cache
th: ล้างแคช
tr: Önbelleği temizle
vi: Xóa bộ nhớ đệm
zh_hans: 清除缓存
zh_hant: 清除快取

# settings.game.java.custom_parameters
source: Custom Parameters
ar: معاملات مخصصة
da: Brugerdefinerede Parametre
de: Benutzerdefinierte Parameter
es: Parámetros Personalizados
fi: Mukautetut Parametrit
fr: Paramètres Personnalisés
hi: कस्टम पैरामीटर
it: Parametri Personalizzati
ja: カスタムパラメータ
ko: 사용자 정의 매개변수
nb: Egendefinerte Parametere
nl: Aangepaste Parameters
pl: Parametry Niestandardowe
pt: Parâmetros Personalizados
ru: Пользовательские Параметры
sv: Anpassade Parametrar
th: พารามิเตอร์กำหนดเอง
tr: Özel Parametreler
vi: Tham Số Tùy Chỉnh
zh_hans: 自定义参数
zh_hant: 自定義參數

# settings.game.java.custom_parameters.note
source: Note: Custom parameters will override the optimization settings above
ar: ملاحظة: المعاملات المخصصة ستتجاوز إعدادات التحسين أعلاه
da: Bemærk: Brugerdefinerede parametre vil tilsidesætte optimaliseringsindstillingerne ovenfor
de: Hinweis: Benutzerdefinierte Parameter überschreiben die obigen Optimierungseinstellungen
es: Nota: Los parámetros personalizados anularán la configuración de optimización anterior
fi: Huomaa: Mukautetut parametrit korvaavat yllä olevat optimointiasetukset
fr: Note: Les paramètres personnalisés remplaceront les paramètres d'optimisation ci-dessus
hi: नोट: कस्टम पैरामीटर ऊपरी अनुकूलन सेटिंग्स को ओवरराइड करेंगे
it: Nota: I parametri personalizzati sostituiranno le impostazioni di ottimizzazione sopra
ja: 注意：カスタムパラメータは上記の最適化設定を上書きします
ko: 참고： 사용자 정의 매개변수는 위의 최적화 설정을 덮어씁니다
nb: Merk: Egendefinerte parametere vil overstyre optimaliseringsinnstillingene ovenfor
nl: Opmerking: Aangepaste parameters zullen de bovenstaande optimalisatie-instellingen overschrijven
pl: Uwaga: Parametry niestandardowe zastąpią powyższe ustawienia optymalizacji
pt: Nota: Parâmetros personalizados substituirão as configurações de otimização acima
ru: Примечание: Пользовательские параметры переопределят настройки оптимизации выше
sv: Obs: Anpassade parametrar kommer att åsidosätta optimeringsinställningarna ovan
th: หมายเหตุ: พารามิเตอร์กำหนดเองจะแทนที่การตั้งค่าการปรับปรุงประสิทธิภาพข้างต้น
tr: Not: Özel parametreler yukarıdaki optimizasyon ayarlarını geçersiz kılacaktır
vi: Lưu ý: Tham số tùy chỉnh sẽ ghi đè các cài đặt tối ưu hóa ở trên
zh_hans: 注意： 自定义参数会覆盖上面的优化设置
zh_hant: 注意：自定義參數會覆蓋上面的優化設置

# settings.game.java.environment_variables
source: Environment Variables
ar: متغيرات البيئة
da: Miljøvariabler
de: Umgebungsvariablen
es: Variables de Entorno
fi: Ympäristömuuttujat
fr: Variables d'Environnement
hi: पर्यावरण चर
it: Variabili di Ambiente
ja: 環境変数
ko: 환경 변수
nb: Miljøvariabler
nl: Omgevingsvariabelen
pl: Zmienne Środowiskowe
pt: Variáveis de Ambiente
ru: Переменные Окружения
sv: Miljövariabler
th: ตัวแปรสภาพแวดล้อม
tr: Ortam Değişkenleri
vi: Biến Môi Trường
zh_hans: 环境变量
zh_hant: 環境變數

# settings.game.java.garbage_collector
source: Garbage Collector
ar: جامع القمامة
da: Affaldsindsamler
es: Recolector de Basura
fi: Roskienkerääjä
fr: Collecteur de Déchets
hi: गार्बेज कलेक्टर
ja: ガベージコレクタ
ko: 가비지 컬렉터
nb: Søppelsamler
pl: Odśmiecacz
pt: Coletor de Lixo
ru: Сборщик Мусора
sv: Skräpuppsamlare
th: ตัวเก็บขยะ
tr: Çöp Toplayıcı
vi: Bộ Thu Gom Rác
zh_hans: 垃圾回收器
zh_hant: 垃圾回收器

# settings.game.java.gc.g1gc
source: G1GC (recommended)
ar: G1GC (موصى به)
da: G1GC (anbefalet)
de: G1GC (empfohlen)
es: G1GC (recomendado)
fi: G1GC (suositeltu)
fr: G1GC (recommandé)
hi: G1GC (अनुशंसित)
it: G1GC (consigliato)
ja: G1GC (推奨）
ko: G1GC (권장）
nb: G1GC (anbefalt)
nl: G1GC (aanbevolen)
pl: G1GC (zalecane)
pt: G1GC (recomendado)
ru: G1GC (рекомендуется)
sv: G1GC (rekommenderas)
th: G1GC (แนะนำ)
tr: G1GC (önerilen)
vi: G1GC (được khuyến nghị)
zh_hans: G1GC (推荐）
zh_hant: G1GC (推薦）

# settings.game.java.gc.g1gc.desc
source: G1 garbage collector, balancing performance and latency, suitable for most scenarios
ar: جامع القمامة G1، يوازن بين الأداء والكمون، مناسب لمعظم السيناريوهات
da: G1 affaldsindsamler, balancerer ydeevne og latens, egnet til de fleste scenarier
de: G1 Garbage Collector, balanciert Leistung und Latenz, geeignet für die meisten Szenarien
es: Recolector de basura G1, equilibra rendimiento y latencia, adecuado para la mayoría de escenarios
fi: G1 roskienkerääjä, tasapainottaa suorituskykyä ja viivettä, sopii useimpiin skenaarioihin
fr: Collecteur de déchets G1, équilibre performance et latence, adapté à la plupart des scénarios
hi: G1 गार्बेज कलेक्टर, प्रदर्शन और विलंबता को संतुलित करता है, अधिकांश परिस्थितियों के लिए उपयुक्त
it: Garbage collector G1, bilancia prestazioni e latenza, adatto alla maggior parte degli scenari
ja: G1ガベージコレクタ、パフォーマンスとレイテンシのバランスを取り、ほとんどのシナリオに適している
ko: G1 가비지 컬렉터， 성능과 지연시간의 균형을 맞추며 대부분의 시나리오에 적합
nb: G1 søppelsamler, balanserer ytelse og latens, egnet for de fleste scenarioer
nl: G1 garbage collector, balanceert prestaties en latentie, geschikt voor de meeste scenario's
pl: Odśmiecacz G1, równoważy wydajność i opóźnienia, odpowiedni dla większości scenariuszy
pt: Coletor de lixo G1, equilibra desempenho e latência, adequado para a maioria dos cenários
ru: Сборщик мусора G1, балансирует производительность и задержку, подходит для большинства сценариев
sv: G1 skräpuppsamlare, balanserar prestanda och latens, lämplig för de flesta scenarier
th: ตัวเก็บขยะ G1 สร้างสมดุลระหว่างประสิทธิภาพและความล่าช้า เหมาะสำหรับสถานการณ์ส่วนใหญ่
tr: G1 çöp toplayıcı, performans ve gecikmeyi dengeleyerek çoğu senaryo için uygun
vi: Bộ thu gom rác G1, cân bằng hiệu suất và độ trễ, phù hợp với hầu hết các tình huống
zh_hans: G1垃圾回收器，平衡性能和延迟，适合大多数场景
zh_hant: G1垃圾回收器，平衡性能和延遲，適合大多數場景

# settings.game.java.gc.parallel
source: ParallelGC (High Throughput)
ar: ParallelGC (إنتاجية عالية)
da: ParallelGC (Høj gennemstrømning)
de: ParallelGC (Hoher Durchsatz)
es: ParallelGC (Alto Rendimiento)
fi: ParallelGC (Korkea läpäisy)
fr: ParallelGC (Haut Débit)
hi: ParallelGC (उच्च थ्रूपुट)
it: ParallelGC (Alto Throughput)
ja: ParallelGC (高スループット）
ko: ParallelGC (높은 처리량）
nb: ParallelGC (Høy gjennomstrømning)
nl: ParallelGC (Hoge doorvoer)
pl: ParallelGC (Wysoka przepustowość)
pt: ParallelGC (Alta Taxa de Transferência)
ru: ParallelGC (Высокая пропускная способность)
sv: ParallelGC (Hög genomströmning)
th: ParallelGC (ปริมาณงานสูง)
tr: ParallelGC (Yüksek Verim)
vi: ParallelGC (Thông lượng cao)
zh_hans: ParallelGC (高吞吐量）
zh_hant: ParallelGC (高吞吐量）

# settings.game.java.gc.parallel.desc
source: Parallel garbage collector, high throughput, suitable for background processing tasks
ar: جامع القمامة المتوازي، إنتاجية عالية، مناسب لمهام المعالجة في الخلفية
da: Parallel affaldsindsamler, høj gennemstrømning, egnet til baggrundsbehandlingsopgaver
de: Paralleler Garbage Collector, hoher Durchsatz, geeignet für Hintergrundverarbeitung
es: Recolector de basura paralelo, alto rendimiento, adecuado para tareas de procesamiento en segundo plano
fi: Rinnakkainen roskienkerääjä, korkea läpäisy, sopii taustakäsittelytehtäviin
fr: Collecteur de déchets parallèle, haut débit, adapté aux tâches de traitement en arrière-plan
hi: समानांतर गार्बेज कलेक्टर, उच्च थ्रूपुट, बैकग्राउंड प्रोसेसिंग कार्यों के लिए उपयुक्त
it: Garbage collector parallelo, alto throughput, adatto per attività di elaborazione in background
ja: 並列ガベージコレクタ、高スループット、バックグラウンド処理タスクに適している
ko: 병렬 가비지 컬렉터， 높은 처리량， 백그라운드 처리 작업에 적합
nb: Parallel søppelsamler, høy gjennomstrømning, egnet for bakgrunnsbehandlingsoppgaver
nl: Parallelle garbage collector, hoge doorvoer, geschikt voor achtergrondverwerkingstaken
pl: Równoległy odśmiecacz, wysoka przepustowość, odpowiedni do zadań przetwarzania w tle
pt: Coletor de lixo paralelo, alta taxa de transferência, adequado para tarefas de processamento em segundo plano
ru: Параллельный сборщик мусора, высокая пропускная способность, подходит для фоновых задач
sv: Parallell skräpuppsamlare, hög genomströmning, lämplig för bakgrundsbearbetningsuppgifter
th: ตัวเก็บขยะแบบขนาน ปริมาณงานสูง เหมาะสำหรับงานประมวลผลในพื้นหลัง
tr: Paralel çöp toplayıcı, yüksek verim, arka plan işleme görevleri için uygun
vi: Bộ thu gom rác song song, thông lượng cao, phù hợp với các tác vụ xử lý nền
zh_hans: 并行垃圾回收器，高吞吐量，适合后台处理任务
zh_hant: 並行垃圾回收器，高吞吐量，適合後台處理任務

# settings.game.java.gc.serial
source: SerialGC (Single Thread)
ar: SerialGC (خيط مفرد)
da: SerialGC (Enkelt tråd)
de: SerialGC (Einzelner Thread)
es: SerialGC (Hilo Único)
fi: SerialGC (Yksi säie)
fr: SerialGC (Thread Unique)
hi: SerialGC (एकल धागा)
it: SerialGC (Thread Singolo)
ja: SerialGC (シングルスレッド）
ko: SerialGC (단일 스레드）
nb: SerialGC (Enkel tråd)
nl: SerialGC (Enkele thread)
pl: SerialGC (Pojedynczy wątek)
pt: SerialGC (Thread Única)
ru: SerialGC (Одиночный поток)
sv: SerialGC (Enskild tråd)
th: SerialGC (เธรดเดียว)
tr: SerialGC (Tek İş Parçacığı)
vi: SerialGC (Luồng đơn)
zh_hans: SerialGC (单线程）
zh_hant: SerialGC (單線程）

# settings.game.java.gc.serial.desc
source: Serial garbage collector, single-threaded, suitable for small memory applications
ar: جامع القمامة التسلسلي، خيط مفرد، مناسب لتطبيقات الذاكرة الصغيرة
da: Seriel affaldsindsamler, enkeltrådet, egnet til små hukommelsesapplikationer
de: Serieller Garbage Collector, single-threaded, geeignet für Anwendungen mit kleinem Speicherbedarf
es: Recolector de basura serial, de un solo hilo, adecuado para aplicaciones de poca memoria
fi: Sarjallinen roskienkerääjä, yksisäikeinen, sopii pienen muistin sovelluksiin
fr: Collecteur de déchets sériel, mono-thread, adapté aux applications à petite mémoire
hi: सीरियल गार्बेज कलेक्टर, एकल-धागा, छोटी मेमोरी वाले ऐप्लिकेशन के लिए उपयुक्त
it: Garbage collector seriale, single-thread, adatto per applicazioni con poca memoria
ja: シリアルガベージコレクタ、シングルスレッド、小さなメモリアプリケーションに適している
ko: 시리얼 가비지 컬렉터， 단일 스레드， 작은 메모리 애플리케이션에 적합
nb: Seriell søppelsamler, enkeltrådet, egnet for små minneapplikasjoner
nl: Seriële garbage collector, single-threaded, geschikt voor kleine geheugenapplicaties
pl: Szeregowy odśmiecacz, jednowątkowy, odpowiedni dla aplikacji o małej pamięci
pt: Coletor de lixo serial, single-thread, adequado para aplicações de pouca memória
ru: Последовательный сборщик мусора, однопоточный, подходит для приложений с малой памятью
sv: Seriell skräpuppsamlare, enkeltrådig, lämplig för små minnesapplikationer
th: ตัวเก็บขยะแบบอนุกรม เธรดเดียว เหมาะสำหรับแอปพลิเคชันที่ใช้หน่วยความจำน้อย
tr: Seri çöp toplayıcı, tek iş parçacığı, küçük bellek uygulamaları için uygun
vi: Bộ thu gom rác tuần tự, đơn luồng, phù hợp với các ứng dụng bộ nhớ nhỏ
zh_hans: 串行垃圾回收器，单线程，适合小内存应用
zh_hant: 串行垃圾回收器，單線程，適合小記憶體應用
